---
kind: method
id: M:Autodesk.Revit.DB.SolidCurveIntersection.GetBasicIEnumerator
source: html/c38bd467-ea49-e950-c2c7-cd7afb8d08f5.htm
---
# Autodesk.Revit.DB.SolidCurveIntersection.GetBasicIEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
internal virtual IEnumerator GetBasicIEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.